# -*- coding: utf-8 -*-



#高股息原贴手工验证过的票，基准测试标的
VERIFY_CODES = [
  # # # 皖通高速
  {'name': '皖通高速', '_id': '600012', 'money': 52105},
  # # # 万华化学
  {'name': '万华化学', '_id': '600309', 'money': 146005},
  # # # 北京银行
  {'name': '北京银行', '_id': '601169', 'money': 88305},
  # # # 大秦铁路
  # # # 2015年4月27日那天，预警价为14.33元，但收盘价只有14.32元，我们按照收盘价计算，
  # # # 差一分钱才触发卖出规则。如果当时卖出，可收回现金14.32*12500+330=179330元。
  # # # 错过这次卖出机会后不久，牛市见顶，股价狂泻，从14元多一直跌到5.98元。
  # # # TODO 需要牛市清盘卖出策略辅助
  {'name': '大秦铁路', '_id': '601006', 'money': 84305},
  # 南京银行
  {'name': '南京银行', '_id': '601009', 'money': 75005},
  # 东风股份
  {'name': '东风股份', '_id': '601515', 'money': 133705},
  # 福耀玻璃
  {'name': '福耀玻璃', '_id': '600660', 'money': 125905},
  # 光大银行
  {'name': '光大银行', '_id': '601818', 'money': 29105},
  # 浦发银行
  {'name': '浦发银行', '_id': '600000', 'money': 74505},
  # 重庆水务
  {'name': '重庆水务', '_id': '601158', 'money': 58105},
  # 中国建筑
  {'name': '中国建筑', '_id': '601668', 'money': 29605},
  # 永新股份
  {'name': '永新股份', '_id': '002014', 'money': 124305},
  # 万科
  {'name': '万科', '_id': '000002', 'money': 72705},
  # 华域汽车
  {'name': '华域汽车', '_id': '600741', 'money': 92005},
  # 宇通客车
  # 再看历史PB情况，在2016年4月，宇通客车的PB位于3.84，中位值3.96，很显然，
  # 不具有很强的估值吸引力。也就是说，如果考虑估值因素，我们将不会买入。
  # TODO 买点看pb？
  {'name': '宇通客车', '_id': '600066', 'money': 203305},
  # 宝钢股份
  # TODO 买点看pb？
  {'name': '宝钢股份', '_id': '600019', 'money': 70705},
  # 荣盛发展
  {'name': '荣盛发展', '_id': '002146', 'money': 99205},
  # 厦门空港
  {'name': '厦门空港', '_id': '600897', 'money': 242805},
  # 金地集团
  {'name': '金地集团', '_id': '600383', 'money': 103205},
  # 海螺水泥
  {'name': '海螺水泥', '_id': '600585', 'money': 295905},
  # 长江电力
  {'name': '长江电力', '_id': '600900', 'money': 63905},
  # 承德露露
  # 可以看到，虽然承德露露目前属于高息股票，但从2011到2016年，它的分红一直不达标
  # TODO 需要持续分红剔除没有做到持续分红的标的
  {'name': '承德露露', '_id': '000848', 'money': 97405},
  # 粤高速A
  {'name': '粤高速A', '_id': '000429', 'money': 75105},
  # 招商银行
  {'name': '招商银行', '_id': '600036', 'money': 101505},
  # 鲁泰A
  {'name': '鲁泰A', '_id': '000726', 'money': 93505},
  
  {'name': '中国石化', '_id': '600028', 'money': 74405},
  {'name': '双汇发展', '_id': '000895', 'money': 211205},
  {'name': '伟星股份', '_id': '002003', 'money': 80805},
  {'name': '兴业银行', '_id': '601166', 'money': 90205},
  {'name': '交通银行', '_id': '601328', 'money': 46905},
  {'name': '方大特钢', '_id': '600507', 'money': 167905},
  # TODO 增加pb指标
  {'name': '中国神华', '_id': '601088', 'money': 219705},
  {'name': '新城控股', '_id': '601155', 'money': 102805},
  {'name': '农业银行', '_id': '601288', 'money': 26405},
  # 2017年全年无分红，2018年出年报就该卖出
  {'name': '格力电器', '_id': '000651', 'money': 296305},

]
# 上证红利50
BONUS_CODES = [
  {'name': "宝钢股份", '_id': "600019"}, {'name': "浙能电力", '_id': "600023"}, {'name': "中国石化", '_id': "600028"},
  {'name': "福建高速", '_id': "600033"}, {'name': "保利地产", '_id': "600048"}, {'name': "宇通客车", '_id': "600066"},
  {'name': "上汽集团", '_id': "600104"}, {'name': "东睦股份", '_id': "600114"}, {'name': "香江控股", '_id': "600162"},
  {'name': "雅戈尔", '_id': "600177"}, {'name': "赣粤高速", '_id': "600269"}, {'name': "南钢股份", '_id': "600282"},
  {'name': "华发股份", '_id': "600325"}, {'name': "山东高速", '_id': "600350"}, {'name': "首开股份", '_id': "600376"},
  {'name': "宁沪高速", '_id': "600377"}, {'name': "金地集团", '_id': "600383"}, {'name': "海澜之家", '_id': "600398"},
  {'name': "方大特钢", '_id': "600507"}, {'name': "深高速", '_id': "600548"}, {'name': "迪马股份", '_id': "600565"},
  {'name': "海螺水泥", '_id': "600585"}, {'name': "申能股份", '_id': "600642"}, {'name': "福耀玻璃", '_id': "600660"},
  {'name': "川投能源", '_id': "600674"}, {'name': "上海石化", '_id': "600688"}, {'name': "物产中大", '_id': "600704"},
  {'name': "华域汽车", '_id': "600741"}, {'name': "马钢股份", '_id': "600808"}, {'name': "梅花生物", '_id': "600873"},
  {'name': "厦门空港", '_id': "600897"}, {'name': "长江电力", '_id': "600900"}, {'name': "恒源煤电", '_id': "600971"},
  {'name': "柳钢股份", '_id': "601003"}, {'name': "大秦铁路", '_id': "601006"}, {'name': "南京银行", '_id': "601009"},
  {'name': "中国神华", '_id': "601088"}, {'name': "兴业银行", '_id': "601166"}, {'name': "农业银行", '_id': "601288"},
  {'name': "交通银行", '_id': "601328"}, {'name': "工商银行", '_id': "601398"}, {'name': "九牧王", '_id': "601566"},
  {'name': "旗滨集团", '_id': "601636"}, {'name': "光大银行", '_id': "601818"}, {'name': "建设银行", '_id': "601939"},
  {'name': "中国银行", '_id': "601988"}, {'name': "中信银行", '_id': "601998"}, {'name': "养元饮品", '_id': "603156"},
  {'name': "渤海轮渡", '_id': "603167"}, {'name': "依顿电子", '_id': "603328"},
]

MY_HOLD = [
  
  {'name': "福建高速", '_id': "600033"},
  {'name': "上汽集团", '_id': "600104"},
  {'name': "雅戈尔", '_id': "600177"},
  {'name': "金地集团", '_id': "600383"},
  {'name': "海螺水泥", '_id': "600585"},
  {'name': "长江电力", '_id': "600900"},
  {'name': "恒源煤电", '_id': "600971"},
  {'name': "南京银行", '_id': "601009"},
  {'name': "农业银行", '_id': "601288"},
  {'name': "交通银行", '_id': "601328"},
  {'name': "工商银行", '_id': "601398"},
  {'name': "建设银行", '_id': "601939"},
  {'name': "华能水电", '_id': "600025"},
  {'name': "万科A", '_id': "000002"},
  {'name': "万年青", '_id': "000789"},
]

class VERSION_DV1:
  BAD_LIST = [
    {
      "_id": "002147",
      "name": "ST新光",
      "percent": -0.72585
    },
    {
      "_id": "000981",
      "name": "ST银亿",
      "percent": -0.64672
    },
    {
      "_id": "002269",
      "name": "美邦服饰",
      "percent": -0.49128
    },
    {
      "_id": "600664",
      "name": "哈药股份",
      "percent": -0.451429
    },
    {
      "_id": "600829",
      "name": "人民同泰",
      "percent": -0.4032
    },
    {
      "_id": "300625",
      "name": "三雄极光",
      "percent": -0.38713
    },
    {
      "_id": "300082",
      "name": "奥克股份",
      "percent": -0.3836405
    },
    {
      "_id": "002335",
      "name": "科华恒盛",
      "percent": -0.32094
    },
    {
      "_id": "000921",
      "name": "海信家电",
      "percent": -0.315504
    },
    {
      "_id": "002503",
      "name": "搜于特",
      "percent": -0.31086
    },
    {
      "_id": "601088",
      "name": "中国神华",
      "percent": -0.302042
    },
    {
      "_id": "300126",
      "name": "锐奇股份",
      "percent": -0.29066
    },
    {
      "_id": "300421",
      "name": "力星股份",
      "percent": -0.27514
    },
    {
      "_id": "600738",
      "name": "兰州民百",
      "percent": -0.2709
    },
    {
      "_id": "600809",
      "name": "山西汾酒",
      "percent": -0.259
    },
    {
      "_id": "000635",
      "name": "英 力 特",
      "percent": -0.25518
    },
    {
      "_id": "300185",
      "name": "通裕重工",
      "percent": -0.250782
    },
    {
      "_id": "600566",
      "name": "济川药业",
      "percent": -0.24552
    },
    {
      "_id": "601566",
      "name": "九牧王",
      "percent": -0.24307
    },
    {
      "_id": "600282",
      "name": "南钢股份",
      "percent": -0.24173
    },
    {
      "_id": "001696",
      "name": "宗申动力",
      "percent": -0.24047
    },
    {
      "_id": "002520",
      "name": "日发精机",
      "percent": -0.23538
    },
    {
      "_id": "300333",
      "name": "兆日科技",
      "percent": -0.23382
    },
    {
      "_id": "600869",
      "name": "智慧能源",
      "percent": -0.23045
    },
    {
      "_id": "603313",
      "name": "梦百合",
      "percent": -0.22645
    },
    {
      "_id": "002365",
      "name": "永安药业",
      "percent": -0.22365
    },
    {
      "_id": "000778",
      "name": "新兴铸管",
      "percent": -0.2235
    },
    {
      "_id": "300512",
      "name": "中亚股份",
      "percent": -0.22345
    },
    {
      "_id": "002601",
      "name": "龙蟒佰利",
      "percent": -0.2222569944
    },
    {
      "_id": "002458",
      "name": "益生股份",
      "percent": -0.2192
    },
    {
      "_id": "300046",
      "name": "台基股份",
      "percent": -0.21838
    },
    {
      "_id": "000825",
      "name": "太钢不锈",
      "percent": -0.2127658
    },
    {
      "_id": "300041",
      "name": "回天新材",
      "percent": -0.21186
    },
    {
      "_id": "000987",
      "name": "越秀金控",
      "percent": -0.20956
    },
    {
      "_id": "600985",
      "name": "淮北矿业",
      "percent": -0.20953
    },
    {
      "_id": "002394",
      "name": "联发股份",
      "percent": -0.20882
    },
    {
      "_id": "600704",
      "name": "物产中大",
      "percent": -0.208035
    },
    {
      "_id": "002662",
      "name": "京威股份",
      "percent": -0.207615
    },
    {
      "_id": "300219",
      "name": "鸿利智汇",
      "percent": -0.2066
    },
    {
      "_id": "000603",
      "name": "盛达矿业",
      "percent": -0.20245
    },
    {
      "_id": "600516",
      "name": "方大炭素",
      "percent": -0.2024
    },
    {
      "_id": "002414",
      "name": "高德红外",
      "percent": -0.197878
    },
    {
      "_id": "002068",
      "name": "黑猫股份",
      "percent": -0.19684
    },
    {
      "_id": "600873",
      "name": "梅花生物",
      "percent": -0.193829
    },
    {
      "_id": "000036",
      "name": "华联控股",
      "percent": -0.19226
    },
    {
      "_id": "002478",
      "name": "常宝股份",
      "percent": -0.18824
    },
    {
      "_id": "300230",
      "name": "永利股份",
      "percent": -0.186401
    },
    {
      "_id": "601369",
      "name": "陕鼓动力",
      "percent": -0.18414
    },
    {
      "_id": "603360",
      "name": "百傲化学",
      "percent": -0.1832
    },
    {
      "_id": "002763",
      "name": "汇洁股份",
      "percent": -0.18298
    },
    {
      "_id": "000780",
      "name": "平庄能源",
      "percent": -0.18149
    },
    {
      "_id": "000861",
      "name": "海印股份",
      "percent": -0.17372
    },
    {
      "_id": "002444",
      "name": "巨星科技",
      "percent": -0.17334
    },
    {
      "_id": "000848",
      "name": "承德露露",
      "percent": -0.17133
    },
    {
      "_id": "601169",
      "name": "北京银行",
      "percent": -0.1695761
    },
    {
      "_id": "600641",
      "name": "万业企业",
      "percent": -0.1685934
    },
    {
      "_id": "600681",
      "name": "百川能源",
      "percent": -0.16851
    },
    {
      "_id": "603988",
      "name": "中电电机",
      "percent": -0.167821
    },
    {
      "_id": "600398",
      "name": "海澜之家",
      "percent": -0.166126
    },
    {
      "_id": "600312",
      "name": "平高电气",
      "percent": -0.16551
    },
    {
      "_id": "601636",
      "name": "旗滨集团",
      "percent": -0.16299
    },
    {
      "_id": "000488",
      "name": "晨鸣纸业",
      "percent": -0.15915
    },
    {
      "_id": "600090",
      "name": "同济堂",
      "percent": -0.1575
    },
    {
      "_id": "002042",
      "name": "华孚时尚",
      "percent": -0.15635
    },
    {
      "_id": "000631",
      "name": "顺发恒业",
      "percent": -0.153848
    },
    {
      "_id": "603355",
      "name": "莱克电气",
      "percent": -0.153438
    },
    {
      "_id": "603001",
      "name": "奥康国际",
      "percent": -0.14904
    },
    {
      "_id": "002351",
      "name": "漫步者",
      "percent": -0.14685
    },
    {
      "_id": "002884",
      "name": "凌霄泵业",
      "percent": -0.14126
    },
    {
      "_id": "300195",
      "name": "长荣股份",
      "percent": -0.13563
    }

  ]
  GOOD_LIST = [
              {
                "_id": "002489",
                "name": "浙江永强",
                "percent": 5.017021588
              },
              {
                "_id": "000651",
                "name": "格力电器",
                "percent": 4.96886
              },
              {
                "_id": "600578",
                "name": "京能电力",
                "percent": 4.55845
              },
              {
                "_id": "600741",
                "name": "华域汽车",
                "percent": 3.894628
              },
              {
                "_id": "002563",
                "name": "森马服饰",
                "percent": 3.62277
              },
              {
                "_id": "601799",
                "name": "星宇股份",
                "percent": 3.438566
              },
              {
                "_id": "601009",
                "name": "南京银行",
                "percent": 3.4096007
              },
              {
                "_id": "000002",
                "name": "万 科Ａ",
                "percent": 3.172593
              },
              {
                "_id": "601166",
                "name": "兴业银行",
                "percent": 3.01044
              },
              {
                "_id": "600317",
                "name": "营口港",
                "percent": 2.9743295
              },
              {
                "_id": "002242",
                "name": "九阳股份",
                "percent": 2.888265
              },
              {
                "_id": "601222",
                "name": "林洋能源",
                "percent": 2.713464
              },
              {
                "_id": "600183",
                "name": "生益科技",
                "percent": 2.67989
              },
              {
                "_id": "600036",
                "name": "招商银行",
                "percent": 2.491724
              },
              {
                "_id": "600177",
                "name": "雅戈尔",
                "percent": 2.359914
              },
              {
                "_id": "002572",
                "name": "索菲亚",
                "percent": 2.28955
              },
              {
                "_id": "600027",
                "name": "华电国际",
                "percent": 2.2609075
              },
              {
                "_id": "002565",
                "name": "顺灏股份",
                "percent": 2.156584
              },
              {
                "_id": "002671",
                "name": "龙泉股份",
                "percent": 2.114039190228
              },
              {
                "_id": "601818",
                "name": "光大银行",
                "percent": 2.032877
              },
              {
                "_id": "600000",
                "name": "浦发银行",
                "percent": 1.8850409
              },
              {
                "_id": "600900",
                "name": "长江电力",
                "percent": 1.82308238
              },
              {
                "_id": "601939",
                "name": "建设银行",
                "percent": 1.80892711
              },
              {
                "_id": "600660",
                "name": "福耀玻璃",
                "percent": 1.807923
              },
              {
                "_id": "600015",
                "name": "华夏银行",
                "percent": 1.7823503
              },
              {
                "_id": "600863",
                "name": "内蒙华电",
                "percent": 1.714646
              },
              {
                "_id": "000559",
                "name": "万向钱潮",
                "percent": 1.676016
              },
              {
                "_id": "600104",
                "name": "上汽集团",
                "percent": 1.511196
              },
              {
                "_id": "600377",
                "name": "宁沪高速",
                "percent": 1.412348
              },
              {
                "_id": "600011",
                "name": "华能国际",
                "percent": 1.3738
              },
              {
                "_id": "600252",
                "name": "中恒集团",
                "percent": 1.362165
              },
              {
                "_id": "601633",
                "name": "长城汽车",
                "percent": 1.304756
              },
              {
                "_id": "002372",
                "name": "伟星新材",
                "percent": 1.3025219
              },
              {
                "_id": "601328",
                "name": "交通银行",
                "percent": 1.28513639
              },
              {
                "_id": "000333",
                "name": "美的集团",
                "percent": 1.22857
              },
              {
                "_id": "601877",
                "name": "正泰电器",
                "percent": 1.215464
              },
              {
                "_id": "601567",
                "name": "三星医疗",
                "percent": 1.21271
              },
              {
                "_id": "601998",
                "name": "中信银行",
                "percent": 1.2125123
              },
              {
                "_id": "600795",
                "name": "国电电力",
                "percent": 1.11239
              },
              {
                "_id": "600004",
                "name": "白云机场",
                "percent": 1.111571
              },
              {
                "_id": "000723",
                "name": "美锦能源",
                "percent": 1.08955
              },
              {
                "_id": "002689",
                "name": "远大智能",
                "percent": 1.084424
              },
              {
                "_id": "600048",
                "name": "保利地产",
                "percent": 1.0839117
              },
              {
                "_id": "000540",
                "name": "中天金融",
                "percent": 1.07455
              },
              {
                "_id": "600816",
                "name": "安信信托",
                "percent": 1.052292
              },
              {
                "_id": "000828",
                "name": "东莞控股",
                "percent": 1.032156
              },
              {
                "_id": "600012",
                "name": "皖通高速",
                "percent": 1.027666
              },
              {
                "_id": "300428",
                "name": "四通新材",
                "percent": 1.0264
              },
              {
                "_id": "002003",
                "name": "伟星股份",
                "percent": 1.0262226
              },
              {
                "_id": "601155",
                "name": "新城控股",
                "percent": 1.01408
              },
              {
                "_id": "600971",
                "name": "恒源煤电",
                "percent": 1.004420281
              },
              {
                "_id": "600383",
                "name": "金地集团",
                "percent": 0.961334
              },
              {
                "_id": "603519",
                "name": "立霸股份",
                "percent": 0.95589
              },
              {
                "_id": "600018",
                "name": "上港集团",
                "percent": 0.9534872
              },
              {
                "_id": "603328",
                "name": "依顿电子",
                "percent": 0.946328
              },
              {
                "_id": "002085",
                "name": "万丰奥威",
                "percent": 0.93527
              },
              {
                "_id": "601398",
                "name": "工商银行",
                "percent": 0.89271764
              },
              {
                "_id": "000550",
                "name": "江铃汽车",
                "percent": 0.88147
              },
              {
                "_id": "300154",
                "name": "瑞凌股份",
                "percent": 0.87322
              },
              {
                "_id": "601288",
                "name": "农业银行",
                "percent": 0.87031824
              },
              {
                "_id": "000708",
                "name": "大冶特钢",
                "percent": 0.85846
              },
              {
                "_id": "002674",
                "name": "兴业科技",
                "percent": 0.85462
              },
              {
                "_id": "601010",
                "name": "文峰股份",
                "percent": 0.83279
              },
              {
                "_id": "600033",
                "name": "福建高速",
                "percent": 0.796455
              },
              {
                "_id": "601668",
                "name": "中国建筑",
                "percent": 0.7681032
              },
              {
                "_id": "002419",
                "name": "天虹股份",
                "percent": 0.735372
              },
              {
                "_id": "000157",
                "name": "中联重科",
                "percent": 0.71757
              },
              {
                "_id": "600266",
                "name": "北京城建",
                "percent": 0.71539
              },
              {
                "_id": "300327",
                "name": "中颖电子",
                "percent": 0.71258
              },
              {
                "_id": "600585",
                "name": "海螺水泥",
                "percent": 0.695123
              }
  ]
  
  
class  VERSION_DV2:
  TOP30_LIST = [
    {
      "_id": "000651",
      "name": "格力电器"
    },
    {
      "_id": "600741",
      "name": "华域汽车"
    },
    {
      "_id": "000002",
      "name": "万 科Ａ"
    },
    {
      "_id": "601009",
      "name": "南京银行"
    },
    {
      "_id": "601799",
      "name": "星宇股份"
    },
    {
      "_id": "601166",
      "name": "兴业银行"
    },
    {
      "_id": "600183",
      "name": "生益科技"
    },
    {
      "_id": "600036",
      "name": "招商银行"
    },
    {
      "_id": "002003",
      "name": "伟星股份"
    },
    {
      "_id": "600027",
      "name": "华电国际"
    },
    {
      "_id": "600177",
      "name": "雅戈尔"
    },
    {
      "_id": "601818",
      "name": "光大银行"
    },
    {
      "_id": "600000",
      "name": "浦发银行"
    },
    {
      "_id": "601939",
      "name": "建设银行"
    },
    {
      "_id": "600660",
      "name": "福耀玻璃"
    },
    {
      "_id": "600900",
      "name": "长江电力"
    },
    {
      "_id": "600015",
      "name": "华夏银行"
    },
    {
      "_id": "600863",
      "name": "内蒙华电"
    },
    {
      "_id": "600011",
      "name": "华能国际"
    },
    {
      "_id": "600104",
      "name": "上汽集团"
    },
    {
      "_id": "002242",
      "name": "九阳股份"
    },
    {
      "_id": "002372",
      "name": "伟星新材"
    },
    {
      "_id": "600377",
      "name": "宁沪高速"
    },
    {
      "_id": "601328",
      "name": "交通银行"
    },
    {
      "_id": "601567",
      "name": "三星医疗"
    },
    {
      "_id": "000333",
      "name": "美的集团"
    },
    {
      "_id": "601998",
      "name": "中信银行"
    },
    {
      "_id": "601877",
      "name": "正泰电器"
    },
    {
      "_id": "600578",
      "name": "京能电力"
    },
    {
      "_id": "600795",
      "name": "国电电力"
    }
  ]
  
  BOTTOM30_LIST = [
    {
      "_id": "000981",
      "name": "ST银亿"
    },
    {
      "_id": "002269",
      "name": "美邦服饰"
    },
    {
      "_id": "300134",
      "name": "大富科技"
    },
    {
      "_id": "600503",
      "name": "华丽家族"
    },
    {
      "_id": "300082",
      "name": "奥克股份"
    },
    {
      "_id": "002424",
      "name": "贵州百灵"
    },
    {
      "_id": "600664",
      "name": "哈药股份"
    },
    {
      "_id": "601515",
      "name": "东风股份"
    },
    {
      "_id": "603766",
      "name": "隆鑫通用"
    },
    {
      "_id": "000921",
      "name": "海信家电"
    },
    {
      "_id": "002335",
      "name": "科华恒盛"
    },
    {
      "_id": "002503",
      "name": "搜于特"
    },
    {
      "_id": "601088",
      "name": "中国神华"
    },
    {
      "_id": "000568",
      "name": "泸州老窖"
    },
    {
      "_id": "300625",
      "name": "三雄极光"
    },
    {
      "_id": "600738",
      "name": "兰州民百"
    },
    {
      "_id": "002016",
      "name": "世荣兆业"
    },
    {
      "_id": "600809",
      "name": "山西汾酒"
    },
    {
      "_id": "002366",
      "name": "台海核电"
    },
    {
      "_id": "601566",
      "name": "九牧王"
    },
    {
      "_id": "000778",
      "name": "新兴铸管"
    },
    {
      "_id": "600681",
      "name": "百川能源"
    },
    {
      "_id": "300185",
      "name": "通裕重工"
    },
    {
      "_id": "300046",
      "name": "台基股份"
    },
    {
      "_id": "600566",
      "name": "济川药业"
    },
    {
      "_id": "000825",
      "name": "太钢不锈"
    },
    {
      "_id": "000987",
      "name": "越秀金控"
    },
    {
      "_id": "600516",
      "name": "方大炭素"
    },
    {
      "_id": "002394",
      "name": "联发股份"
    },
    {
      "_id": "002068",
      "name": "黑猫股份"
    }
  ]
  
  DVOK_NOT_HS300 = [
    {'_id': '600012', 'name': '皖通高速', },
    {'_id': '600897', 'name': '厦门空港', },
    {'_id': '000429', 'name': '粤高速Ａ', },
    {'_id': '000726', 'name': '鲁 泰Ａ', },
    {'_id': '600377', 'name': '宁沪高速', },
    {'_id': '600033', 'name': '福建高速', },
    {'_id': '600801', 'name': '华新水泥', },
    {'_id': '600548', 'name': '深高速', },
    {'_id': '000789', 'name': '万年青', },
    {'_id': '600035', 'name': '楚天高速', },
    {'_id': '600021', 'name': '上海电力', },
    {'_id': '002233', 'name': '塔牌集团', },
    {'_id': '600269', 'name': '赣粤高速', },
    {'_id': '000027', 'name': '深圳能源', },
    {'_id': '600020', 'name': '中原高速', },
    {'_id': '001872', 'name': '招商港口', },
    {'_id': '600350', 'name': '山东高速', },
    {'_id': '000012', 'name': '南 玻Ａ', },
    {'_id': '601699', 'name': '潞安环能', },
    {'_id': '002440', 'name': '闰土股份', },
  ]
  
  HS300_NOT_DVOK = [
    {'_id': '600025', 'name': '华能水电', },
    {'_id': '601298', 'name': '青岛港', },
    {'_id': '601229', 'name': '上海银行', },
    {'_id': '600919', 'name': '江苏银行', },
    {'_id': '601838', 'name': '成都银行', },
  ]